{
  "letters": [
    {
      "id": "2026-02-11",
      "date": "February 11, 2026",
      "title": "With Intention",
      "preview": "Welcome to Valentine's week. Writing is becoming fun, you know...",
      "unlockDate": "2026-02-11T09:00:00",
      "content": [
        "Welcome to Valentine's week.",
        "Writing is becoming fun, you know. It helps me say everything I want to say without stressing about finding the perfect words in the moment. So I'm just going to write.",
        "Thank you for being my Valentine again. If that sounds weird, I honestly do not think it is. I feel calmer than I expected to feel. Not only because you said yes, even though I'm really thankful you did, but because I think I'm settled in what this is. I'm in love with my person. And I'm not trying to control anything. Jesus is in charge, and what will be, will be. He controls all. I'm just grateful I get to love you.",
        "<strong>To you, Adepileola.</strong> And yeah, I'm spelling it because I like how your name looks when I write it.",
        "Thank you. Thank you for teaching me what love can look like in your own quiet way. Thank you for influencing my growth in areas of my life without even forcing it. Thank you for being you. Thank you for standing on what you believe, your morals, your standards, the way you move. I respect that more than I probably say out loud. And I'm thankful you're so sure about how you want things to be, because it has opened my eyes and challenged me to be better.",
        "Is it fair to say thank you for being pretty? Because you are. And it genuinely helps me more than you know. I keep a picture of you in my wallet, the one we took in Eneni's room. I still look at it when I'm having a hard day. There's another set too, from Fire Up Fear. They're a little crooked in my wallet right now, but they're there every day. I love that I have you with me like that.",
        "I'm learning to be intentional because I love you. And I'm also learning how intentional Jesus is with me, with the way He loves me, and I want to translate that kind of care to you. I want you to feel loved in a way that is steady, not confusing. Gentle, not forced. Real, not just words.",
        "Forgive me for how much I write. I know I ramble when I talk. Sometimes my point comes out wrong and I hate that feeling. Writing helps me process first so I can show up better. I hope I'm not pressuring you. I hope I'm not too much. I'm not trying to make you carry anything heavy. I'm just being honest.",
        "Sometimes I feel undeserving, like I'm still learning what love really means, and I don't want to use that word casually. But I do know this, in this moment, I'm full of gratitude that I get to love you. Loving you has made me want to be more intentional. It has made me want to improve. The same way loving Jesus makes me want to grow closer to Him, loving you makes me want to grow in how I show up.",
        "So yes, this might be a weird Valentine's note. But it's mine. It's my thoughts, and they're true.",
        "Thank you. I love you. You are genuinely one of the most amazing people I've ever met. If things feel off sometimes, I'm sorry. I'm still learning how to be fully myself around you without overthinking. So please be patient with me. And please forgive me when I miss it.",
        "Be safe. Be good. I'm always rooting for you."
      ],
      "signature": "With all love and so much respect,<br><strong>Praise</strong>"
    },
    {
      "id": "2026-02-06",
      "date": "February 6, 2026",
      "title": "I Watched You Shine",
      "preview": "I just watched you do your thing at OBU, and I couldn't let the night end without saying this properly.",
      "content": [
        "Hey,",
        "I just watched you do your thing at OBU, and I couldn't let the night end without saying this properly.",
        "You have that star factor. Like, genuinely. The kind you can't fake, can't teach, can't force. You step into a room and it shifts. You step on a stage and it makes sense. Watching you own that part of yourself was so attractive to me, not just because you looked beautiful (you did, a lot), but because you looked like you belonged there.",
        "And your dress… wow. You looked so pretty. It was one of those moments where I kept catching myself staring like, \"Yeah. That's her.\" But even beyond how you looked, it was the work behind it that hit me. The hard work, the sweat, the sacrifice, the pressure, all of it showed. And it paid off because you killed it. You really did.",
        "I'm not always the best at putting everything into words in person, especially when I'm feeling a lot. Sometimes I can talk, but the real truth is I need quiet to say what I mean. So this is me doing that.",
        "I came back home and realized being out wasn't even fun. My mind kept drifting back to you. I kept thinking how much I'd rather be with you, even if it's just sitting close, just being there with you. Cuddled up in a chair sounds better than any outside plan, and I mean that.",
        "I've told you before that you're an amazing soul. I've told you you're pretty. But your beauty is rare. It's not just your face, it's your light. It's how you carry yourself. It's how you keep growing into who you are, more confident, more bold, more you. And watching that confidence bloom is one of my favorite things because it's contagious. It makes me proud, and it makes me want to match your energy in my own life too.",
        "If I'm being honest, I feel sold on you. Like, fully. I don't know how else to say it without sounding like I'm trying too hard, but it's true. I'm proud of you. I'm proud of your work. I'm proud of the way you show up. And I love watching you do what makes you happy, because when you're happy you shine in a way that's hard to describe and impossible to ignore.",
        "To say \"I'm in love\" is easy, but I want you to understand what I mean when I say it: I admire you. I'm drawn to you. I respect you. I'm inspired by you. And I feel lucky to be close enough to witness you becoming even more of who you already are.",
        "I hope you let this land the way I mean it."
      ],
      "signature": "Goodnight,<br><strong>Praise</strong>"
    },
    {
      "id": "2026-01-28",
      "date": "January 28, 2026",
      "title": "The First",
      "preview": "I hope when you read this, you realize I'm on a journey to make this work. For real.",
      "content": [
        "Adufe,",
        "I hope when you read this, you realize I'm on a journey to make this work. <strong>For real.</strong>",
        "Not out of fear. Not out of yearning. Out of the realization that I'm truly in love with one person.",
        "God willing, I grow in this process. Not rushed. Because the times I rushed, I forgot who put me in this position. His name is Jesus.",
        "So I'm slowing down. Moving at your pace. Treating you with the respect you deserve because I'm trying to honor you. And honor what God has taught us love is supposed to be.",
        "<em>\"Being in love\"</em> is easy to say. So I hope my actions teach me, in this slowed process, how to love you the way Jesus loves you.",
        "I'm not comparing myself to Him. His love has no conditions. I'm flawed. I could write a whole list of things wrong with me.",
        "But one thing I know for sure, after months, after days, even after breaking up, I realized I'm so in love with one person.",
        "<strong>You.</strong>",
        "Adufe, I don't think anyone comes close.",
        "I pray about you because I don't want to mess up what God is doing in your life.",
        "So what am I trying to say?",
        "With God leading and me putting in the effort, I hope you'll accept to be my Valentine. I hope this slow journey works. And I hope I treat you right."
      ],
      "signature": "With love and intention,<br><strong>Praise</strong>"
    }
  ]
}
